export interface AsmaAllahHusna {
  name: string;
  transliteration: string;
  number: number;
  en: {
    meaning: string;
  };
}

type AllahNames_Ar =
  | "الرَّحْمَنُ"
  | "الرَّحِيمُ"
  | "الْمَلِكُ"
  | "الْقُدُّوسُ"
  | "السَّلاَمُ"
  | "الْمُؤْمِنُ"
  | "الْمُهَيْمِنُ"
  | "الْعَزِيزُ"
  | "الْجَبَّارُ"
  | "الْمُتَكَبِّرُ"
  | "الْخَالِقُ"
  | "الْبَارِئُ"
  | "الْمُصَوِّرُ"
  | "الْغَفَّارُ"
  | "الْقَهَّارُ"
  | "الوَهَّابُ"
  | "الرَّزَّاقُ"
  | "الْفَتَّاحُ"
  | "اَلْعَلِيْمُ"
  | "الْقَابِضُ"
  | "الْبَاسِطُ"
  | "الْخَافِضُ"
  | "الرَّافِعُ"
  | "المُعِزُّ"
  | "المُذِلُّ"
  | "السَّمِيعُ"
  | "البَصِيرُ"
  | "الْحَكَمُ"
  | "الْعَدْلُ"
  | "اللَّطِيفُ"
  | "الْخَبِيرُ"
  | "الْحَلِيمُ"
  | "الْعَظِيمُ"
  | "الْغَفُورُ"
  | "الشَّكُورُ"
  | "العَلِيُّ"
  | "الكَبِيرُ"
  | "الحَفِيظُ"
  | "المقيِتُ"
  | "الحسيبُ"
  | "الجَلِيلُ"
  | "الكَرِيمُ"
  | "الرَّقِيبُ"
  | "المجِيبُ"
  | "الوَاسِعُ"
  | "الحكيمُ"
  | "الوَدودُ"
  | "المجيدُ"
  | "الباعثُ"
  | "الشَّهِيدُ"
  | "الحَقُّ"
  | "الوَكِيلُ"
  | "القَوِيُّ"
  | "المتينُ"
  | "الوليُّ"
  | "الحَميد";

  export interface AllahNames {
    ar: AllahNames_Ar;
  }